Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
}

void BufInit(void)
{
	memset(IPDNum, 0, sizeof(IPDNum));
	memset(INADDR_ANY, 0, sizeof(INADDR_ANY));
	memset(msg, 0, sizeof(msg));
	memset(u16data, 0, sizeof(u16data));
	memset(usart_wifi_buf, 0, sizeof(usart_wifi_buf));
	memset(SrvBuf, 0, sizeof(SrvBuf));
}

void SocketInit(void)
{
	uint32_t i;
	
	// BC_MAX_SOCKET_NUM == 5;
	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		memset(&sock_data[i], 0, sizeof(BC_SocketData));
	}
	sock_data[0].buf = SockBuf_0;
	sock_data[1].buf = SockBuf_1;
	sock_data[2].buf = SockBuf_2;
	sock_data[3].buf = SockBuf_3;
	sock_data[4].buf = SockBuf_4;
}

sint32_t BC_QueueInit(void)
{
	sint32_t result = BC_OK;
	
	if(!(xQueue0 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue1 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue2 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue3 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue4 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	
	return result;
}

sint32_t BC_MutexInit(void)
{
	sint32_t result = BC_OK;
	
	if(!(xMutexWifiStateFlag = xSemaphoreCreateBinary())) 	result |= BC_ERR;
	if(!(xMutexRecvFlag = xSemaphoreCreateBinary())) 		result |= BC_ERR;
	
	return result;
}

volatile void xUSART2_IRQHandler(void)
{	
	static uint32_t Index = 0;
	static uint16_t u16PackSize = 0;
	static uint32_t IPDState = IPD_STATE_START_PROBE;
	// static uint32_t 
	static uint16_t num = 0;
	static uint8_t i = 0;
	static uint16_t FirstComma = 0, SecondComma = 0, Colon = 0;
	static uint16_t RxData=0;
	static uint16_t u16SocketID = 0;
	static sint32_t u32CurrentSockId = -1;
	uint32_t u32Tmp = 0;
	
	// uputs(USART_TERMINAL, "u2\r\n");
	if(USART_GetITStatus(USART_WIFI, USART_IT_RXNE) == RESET) {
		return;
	}
	RxData = USART_RECEIVE(USART_WIFI, RxData);
	// i = (char)(0xFF & RxData);
	// sprintf(u16data, "%02x ", i);
	// uputs(USART_TERMINAL, u16data);
	// i = 0;
	// return;
	
	if(GET_WIFI_USART_STATE() == WIFI_USART_STATE_RUNNING) {
		usart_wifi_buf[Index++] = (uint8_t)RxData;
		if(Index >= WIFI_BUF_SIZE - 1) {
			// StartReceiveFlag = 0;
			// SET_WIFI_USART_STATE(WIFI_MSG_FLAG_BUF_OVERFLOW);
			IPDState = IPD_STATE_START_PROBE;
			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
			Index = 0;
			return;
		}
		// IPD PACKET
		switch(IPDState) {
			case IPD_STATE_START_PROBE:
				if('+' == usart_wifi_buf[0]) {
					IPDState = IPD_STATE_HANDLE_HEADER;
				}
				break;
				// Not return, 
				// because we don't know whether it's an another packet type
			case IPD_STATE_HANDLE_HEADER:
				if( Index >= 4) {
					if (usart_wifi_buf[0] == '+' && 
						usart_wifi_buf[1] == 'I' && 
						usart_wifi_buf[2] == 'P' && 
						usart_wifi_buf[3] == 'D' 	) {
							IPDState = IPD_STATE_HANDLE_SOCKET_ID;
						} else {
							IPDState = IPD_STATE_START_PROBE;
						}
				}
				// Not return, 
				// because we don't know whether it's an another packet type
				break;
			case IPD_STATE_HANDLE_SOCKET_ID:
				if(Index <= 4) {
					// retrive the previous state
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				FirstComma = 0;
				SecondComma = 0;
				for(i = 4; i < Index; i++) {
					if(',' == usart_wifi_buf[i] && 0 == FirstComma) {
						FirstComma = i;
					}
					else if(',' == usart_wifi_buf[i] && FirstComma != 0) {
						SecondComma = i;
						break;
					}
				}
				if(0 == FirstComma || 0 == SecondComma) {
					return;
				}
				u32Tmp = SecondComma-FirstComma-1; // number of digit
				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				memcpy((void *)IPDNum, (void *)usart_wifi_buf[FirstComma+1], u32Tmp);
				IPDNum[u32Tmp] = '\0';
				u32Tmp = atoi(IPDNum);
				if(u32Tmp < 0 || u32Tmp > 4) {
					// out of range
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				// u16SocketID = u32Tmp;
				u32CurrentSockId = u32Tmp;
				IPDState = IPD_STATE_HANDLE_SIZE;
				return;
				break; // never come here
			case IPD_STATE_HANDLE_SIZE:
				Colon = 0;
				SecondComma = 0;
				for(i = Index - 1; i > 4; i--) {
					if(';' == usart_wifi_buf[i] && 0 == Colon) {
						Colon = i;
					}
					else if(',' == usart_wifi_buf[i] && Colon != 0) {
						SecondComma = i;
						break;
					}
				}
				if(0 == Colon || 0 == SecondComma) {
					return;
				}
				u32Tmp = Colon - SecondComma - 1; // number of digit
				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				memcpy((void *)IPDNum, (void *)&usart_wifi_buf[SecondComma+1], u32Tmp);
				IPDNum[u32Tmp] = '\0';
				u32Tmp = atoi(IPDNum);
				if(u32Tmp > 5000) {  // max msg size 5000(temporarily 5000)
					// out of range
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				u16PackSize = u32Tmp;
				IPDState = IPD_STATE_HANDLE_CONTENT;
				return;
				break; // never come here
			case IPD_STATE_HANDLE_CONTENT:
				if(Index > Colon + u16PackSize) {
					IPDState = IPD_STATE_COMPLETED;
				} else {
					return;
					break; // never come here
				}
				// no break here
			case IPD_STATE_COMPLETED:
				// TODO:
				// handle \r\n left;
				if(u16PackSize > SOCKET_BUF_SIZE) {
					IPDState = IPD_STATE_START_PROBE;
				} else if(u16SocketID > 4) {
					IPDState = IPD_STATE_START_PROBE;
				} else {
					if(usart_wifi_buf[Index-1] == '\n' && usart_wifi_buf[Index-2] == '\r') {
						memcpy(sock_data[u32CurrentSockId].buf, &usart_wifi_buf[Colon+1], u16PackSize);
						IPDState = IPD_STATE_START_PROBE;
					}
				}
				
				return;
			default:
				IPDState = IPD_STATE_START_PROBE;
				break;
		}
		
		// client connects to local server
		if(Index >= 1) {
			if(isdigit(usart_wifi_buf[0])) {
				u32CurrentSockId = BC_Atoi(usart_wifi_buf[0]);
				if(Index >= WIFI_MSG_CONNECT_TERMINATOR_SIZE) {
					if( usart_wifi_buf[Index-1] == '\n'	&& 
						usart_wifi_buf[Index-2] == '\r'	&&
						usart_wifi_buf[Index-3] == 'T' 	&&
						usart_wifi_buf[Index-4] == 'C' 	&&
						usart_wifi_buf[Index-5] == 'E' 	&&	
						usart_wifi_buf[Index-6] == 'N' 	&&
						usart_wifi_buf[Index-7] == 'N' 	&&
						usart_wifi_buf[Index-8] == 'O' 	&&
						usart_wifi_buf[Index-9] == 'C' 	) {
							sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CONNECT;
							return;
						}							
				}
				if(Index >= WIFI_MSG_CLOSED_TERMINATOR_SIZE) {
					if( usart_wifi_buf[Index-1] == '\n'	&& 
						usart_wifi_buf[Index-2] == '\r'	&&
						usart_wifi_buf[Index-3] == 'D' 	&&
						usart_wifi_buf[Index-4] == 'E' 	&&	
						usart_wifi_buf[Index-5] == 'S' 	&&
						usart_wifi_buf[Index-6] == 'O' 	&&
						usart_wifi_buf[Index-7] == 'L' 	&&
						usart_wifi_buf[Index-8] == 'C' 	) {
							sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CLOSED;
							return;
						}							
				}
			}
		}
		if(Index >= 10) {
			if( usart_wifi_buf[Index-1] == 'S'	&& 
				usart_wifi_buf[Index-2] == 'U'	&&
				usart_wifi_buf[Index-3] == 'T' 	&&
				usart_wifi_buf[Index-4] == 'A' 	&&
				usart_wifi_buf[Index-5] == 'T' 	&&	
				usart_wifi_buf[Index-6] == 'S' 	&&
				usart_wifi_buf[Index-7] == 'P' 	&&
				usart_wifi_buf[Index-8] == 'I' 	&&
				usart_wifi_buf[Index-9] == 'C' 	&& 
				usart_wifi_buf[Index-10] =='+' 	) {
				}	
		}
		// END TERMINAL PACKET
		if(Index >= WIFI_MSG_OK_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'K' 	&&
				usart_wifi_buf[Index-4] == 'O' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
					Index = 0;
					return;
			}
		}
		if(Index >= WIFI_MSG_ERR_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'R' 	&&
				usart_wifi_buf[Index-4] == 'O' 	&&
				usart_wifi_buf[Index-5] == 'R' 	&&
				usart_wifi_buf[Index-6] == 'R' 	&&
				usart_wifi_buf[Index-7] == 'E' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
					Index = 0;
					return;
			}
		}
	} else if(GET_WIFI_USART_STATE() == WIFI_USART_STATE_INIT) {
		usart_wifi_buf[Index++] = (uint8_t)RxData;
		if(Index >= WIFI_BUF_SIZE - 1) {
			// StartReceiveFlag = 0;
			WifiRecvFlag |= WIFI_MSG_FLAG_BUF_OVERFLOW;
			IPDState = IPD_STATE_START_PROBE;
			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
			Index = 0;
			return;
		}
		// WifiRecvFlag = 0;
		// END TERMINAL PACKET
		if(Index >= WIFI_MSG_OK_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'K' 	&&
				usart_wifi_buf[Index-4] == 'O' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
					Index = 0;
					return;
			}
		}
		if(Index >= WIFI_MSG_ERR_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'R' 	&&
				usart_wifi_buf[Index-4] == 'O' 	&&
				usart_wifi_buf[Index-5] == 'R' 	&&
				usart_wifi_buf[Index-6] == 'R' 	&&
				usart_wifi_buf[Index-7] == 'E' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
					Index = 0;
					return;
			}
		}
		
